# 字典: 描述事物的信息
# 空字典
a = {}
# print(type(a),a)
# 有个人叫小明,13岁,身高150,体重300
# a = {'姓名': '小明','年龄': 13,'身高': 150,'体重': 300}
a = {
    '姓名': '小明',
    '年龄': 13,
    '身高': 150,
    '体重': 300,
    '爱好': '篮球'
}
# 字典的值的获取: 根据key获取value值
# print(a['姓名'],a['年龄'],a['身高'],a['体重'],a['爱好'])
# 设置字典的值: 根据key设置value值
a['姓名'] = '小红'
# print(a)
a['aaa'] = 'ddd'
# print(a['姓名'],a['年龄'],a['身高'],a['体重'])
# print(a)

a = {
    'name': '小明',
    'age': 13,
    'height': 150,
    'weight': 300,
    'like': '篮球'
}
# print(a['name'])

# 字典和列表的结合
list = [
    {'姓名': '小明','年龄': 13,'身高': 151,'体重': 320},
    {'姓名': '小红','年龄': 15,'身高': 152,'体重': 330},
    {'姓名': '小方','年龄': 11,'身高': 153,'体重': 340},
    {'姓名': '小人','年龄': 20,'身高': 145,'体重': 350}
]

# print(list[1]['姓名'])

movie_list = [
    {'名字': '绝杀围城','star': 7.7,'msg': '天魔大战食人蛮夷','主演': ['王道铁','王丽娜','刘某']},
    {'名字': '绝杀围城1','star': 7.7,'msg': '天魔大战食人蛮夷1','主演': ['王道铁1','王丽娜1','刘某']},
    {'名字': '绝杀围城2','star': 7.7,'msg': '天魔大战食人蛮夷2','主演': ['王道铁','王丽娜32','刘某1']},
]
dic = {
    "status": "0000",
    "message": "success",
    "data": {
        "title": {
            "id": "001",
            "name" : "白菜"
        },
        "content": [
            {
                "id": "001",
                "value":"你好 白菜"
            },
            {
                "id": "002",
                 "value":"你好 萝卜"
            }
        ]
    }
}
print(dic['data']['content'][0]['value'])