# 选择排序: 将列表中的每一个元素和后面所有的元素比较,如果前面的元素比后面的元素大,则交互两个元素位置
# 		   [5,4,3,2,1]
# 第一次排序:  4,5,3,2,1
# 第二次排序:  3,5,4,2,1
# 第三次排序:  2,5,4,3,1
# 第四次排序:  1,5,4,3,2
a = [12,3123,123,3,4,354,234,345,346,45,6543]
from randomlist import randList
# 下标: 0 后面所有的元素下标: 1 到   len(a) - 1
# 下标: 1 后面所有的元素下标: 2 到   len(a) - 1
# 下标: 2 后面所有的元素下标: 3 到   len(a) - 1
for i in range(len(a)):
    for j in range(i + 1,len(a)):
        if a[i] > a[j]:
            a[i],a[j] = a[j],a[i]
print(a)







# 交换列表里面的元素位置
# a = [1,2,3]
# a[0],a[2] = a[2],a[0]
# print(a)
# a = 10
# b = 20
# # a,b = b,a
# c = a
# a = b
# b = c
# print(a,b)