# 实现约一约的功能
print('打开手机')
print('打开某陌.')
print('在该软件里面,找一个比较好的xxx')
print('约一约,看个电影,吃个饭..')
print('开开心心')
print('各回各家,各找个妈')

# 第二天,还要再约一次
print('打开手机')
print('打开某陌.')
print('在该软件里面,找一个比较好的xxx')
print('约一约,看个电影,吃个饭..')
print('开开心心')
print('各回各家,各找个妈')

# 第三天,还要再约一次
print('打开手机')
print('打开某陌.')
print('在该软件里面,找一个比较好的xxx')
print('约一约,看个电影,吃个饭..')
print('开开心心')
print('各回各家,各找个妈')

# 一直约
# while True:
#     print('打开手机')
#     print('打开某陌.')
#     print('在该软件里面,找一个比较好的xxx')
#     print('约一约,看个电影,吃个饭..')
#     print('开开心心')
#     print('各回各家,各找个妈')

# 做完某些事情之后,再考虑约一约
print('工作完毕..')
print('打开手机')
print('打开某陌.')
print('在该软件里面,找一个比较好的xxx')
print('约一约,看个电影,吃个饭..')
print('开开心心')
print('各回各家,各找个妈')

print('发工资了...')
print('打开手机')
print('打开某陌.')
print('在该软件里面,找一个比较好的xxx')
print('约一约,看个电影,吃个饭..')
print('开开心心')
print('各回各家,各找个妈')

