# # 这是打印函数
# print(123)
# print(456)
# # 程序终止
# exit()
# # 姓名
# name = '张三'
# # 年龄
# b = 20
# # 身高
# c = 170
# # 体重
# d = 170
# print(a)

# print('a')
# 变量的定义
# a = 10  # 将10赋值给a变量
# 变量可以重复定义(变量的重新赋值)
# a = 'aaa'
# # 变量之间也可以进行赋值
# b = a
# print(a)
# print('+++++')
# print(b)
# c1 = 20
# print(c1)
# _a = 10
# print(_a)
# 哈哈 = 19
# print(哈哈)
# a+b = 10
# print(a1)
# a = 10,b = 20
# 可以设置一次性设置多个变量
# a,b,c = 10,'aaaa',30
# print(a)
# print(b)
# print(c)
# 可以一次性打印多个内容,会显示在同一行 (中间逗号隔开)
# print(a,b,c)
a = 10
b = 50
# 操作 (你们自己写代码)实现a和b变量值的互换
# 最简单(其他编程语言没有,属于python独有)
# a,b = b,a
# 其他编程语言的实现方式,找一个变量用来存储数据
# 将a赋值给c,c = 10
c = a
# 将b的值赋值给a,a = 50
a = b
# 将c的值赋值给b,b = 10
b = c
print(a,b)














