a = [{'姓名': 'aaa','qq': 111,'微信': 2222,'地址': '北京'},{'姓名': 'bbb','qq': 111,'微信': 2222,'地址': '北京'},{'姓名': 'aaa','qq': 111,'微信': 2222,'地址': '北京'},{'姓名': 'aaa','qq': 111,'微信': 2222,'地址': '北京'}]

# 新建列表来删除.. (不建议使用)

# 删除名字为aaa
# for i in a:
#     if i['姓名'] == 'aaa':
#         # 删除
#         a.remove(i)
# print(a)
# userInput = input('请输入你要删除的名字: ')
# isDelete = input('输入是否要删除: ')
# i = 0
# while i < len(a):
#     if a[i]['姓名'] == userInput:
#         a.remove(a[i])
#         i -= 1
#     i += 1
# print(a)

# a = {'姓名': 'aaa','qq': 111,'微信': 2222,'地址': '北京'}
#
# a['姓名'] = 'bbb'

print(0 or 2)