import csv
# 数据
data = [
    {'姓名': '张三','性别': '男','年龄': 20,'身高': 180},
    {'姓名': '李四','性别': '女','年龄': 18,'身高': 160},
    {'姓名': '王五','性别': '男','年龄': 23,'身高': 150},
    {'姓名': '赵六','性别': '女','年龄': 25,'身高': 190},
    {'姓名': '田七','性别': '男','年龄': 21,'身高': 170}
]
# 表头(表格的第一行内容) 列表(里面的每个元素对应数据里面的字典的key)
header = ['姓名','性别','年龄','身高']

# 表格的写入
# 表格的中文编码: utf-8-sig
# newline='' : 去除空行
with open('人员信息表.csv','w',encoding='utf-8-sig',newline='') as file:
    # 创建表格的写入者
    csv_file = csv.DictWriter(file,header)
    # 写入表头
    csv_file.writeheader()
    # 写入数据
    # 写入一条数据(字典)
    # csv_file.writerow({'姓名': '张三','性别': '男','年龄': 20,'身高': 180})
    # 写入多条数据(列表: 里面有多个字典)
    csv_file.writerows(data)